#---------------- 枣庄医院管理系统 ---- 添加测试数据 ------------------------------
USE yiyuan;

# 1、Menu 资源菜单表
INSERT INTO Menu VALUES 
(2,'挂号信息管理','registration/index.html',1),
(3,'门诊医生管理','doctor/index.html',1),
(4,'药品管理','medicine/index.html',1),
(5,'住院办理','hospital/index.html',1),
(6,'收费项目管理','hospital/charge.html',1),
(7,'在线发药','hospital/dispensing.html',1),
(8,'住院结算','hospital/account.html',1),
(9,'月营业额统计','',0),
(10,'年营业额统计','',0),
(11,'用户管理','User/index.html',1),
(12,'角色管理','Role/index.html',1),
(13,'资源管理','Resource/index.html',1),
(14,'密码管理','User/password.html',1),
(16,'检查收费项目登记','hospital/charge2.html',1);

# 2、Role 角色表
INSERT INTO Role VALUES 
(1,'管理员',1),
(2,'药品管理员',1),
(3,'医生',1),
(4,'医生前台',1),
(5,'住院办理员',1);

# 3、Jur 权限分配表 [对多对]
INSERT INTO Jur VALUES 
(0,1,11),(0,1,12),(0,1,13),(0,1,3),(0,1,6),(0,1,14),
(0,2,4),(0,2,7),(0,2,14),
(0,3,16),(0,3,14),
(0,4,2),(0,4,14),
(0,5,5),(0,5,8),(0,5,14);

# 4、 Usee 用户表
INSERT INTO Usee VALUES 
(1001,'周一','123456',1,'周一','zhouyi@163.com',1),
(1002,'丁二','123456',1,'丁二','dinger@163.com',2),
(1003,'张三','123456',1,'张三','zhangsan@163.com',3),
(1004,'李四','123456',1,'李四','lisi@163.com',4),
(1005,'王五','123456',1,'王五','wangwu@163.com',5),

(1006,'赵六','123456',1,'赵六','zhaoliu@163.com',3);

# 5、KeRome科室表（急诊科，骨科……）
INSERT INTO KeRome VALUES 
(1,'急诊科'),
(2,'口腔科'),
(3,'骨科'),
(4,'神经内科'),
(5,'消化内科'),
(6,'内分泌科'),
(7,'耳鼻喉科'),
(8,'心血管内科'),
(9,'儿科'),
(10,'妇科');

# 6、 Doctor 门诊医生
INSERT INTO Doctor VALUES
(1,'张三','372923199101011738','13199998888','2662356','男','1991-1-1',27,'zhangsan@163.com','专科','老三',1,1003),
(2,'赵六','372923199201011738','13177776666','2662357','男','1992-1-1',26,'zhaoliu@163.com','本科','老六',3,1006);

# 7、GuaHao 挂号记录表-也可以叫病历表
INSERT INTO GuaHao VALUES 
(1001,'狄仁杰','372923199103031738','0003042590',20,'13122223333',1,'男',27,'宰相',1,'钓鱼得病了','已挂号',NOW(),1,1),
(1002,'李元芳','372923199103041738','0003042591',20,'13122224444',1,'男',27,'千牛卫',1,'中箭了','已住院',NOW(),3,2),
(1003,'刘华强','372923199103051738','0003042592',20,'13122225555',1,'男',27,'黑社会',1,'买瓜被砍了','已挂号',NOW(),1,1),
(1004,'陈浩南','372923199103061738','0003042593',20,'13122226666',1,'女',27,'扛把子',2,'被撞了','已住院',NOW(),3,2);

# 8、 ZhuYuan 住院记录表
INSERT INTO ZhuYuan VALUES 
(1,'小花','001',2000,'2018-1-1','已住院','未结算',1002),
(2,'小红','002',3000,'2018-1-1','已住院','未结算',1004);

# 9、Pay 收费项目表
INSERT INTO Pay VALUES 
(1,'X线透视检查',100,'2001-1-1'),
(2,'B超检查',200,'2001-1-1'),
(3,'彩色多普勒检查',300,'2001-1-1'),
(4,'筋脉曲张检查',400,'2001-1-1'),
(5,'其它',500,'2001-1-1');

# 10、 PayRed 收费项目登记表 [多对多] -> 哪个病号进行了哪个收费项目
INSERT INTO PayRed VALUES 
(1,'2018-1-2',1001,1),
(2,'2018-1-2',1002,2),
(3,'2018-1-2',1002,3),
(4,'2018-1-2',1004,4);

# 11、 Yao	药品管理
INSERT INTO Yao VALUES 
('999','101.jpg',10,100,'999感冒灵',1,'专治感冒',18,'详细描述专治感冒','三无公司','销售中',100),
('blf','102.jpg',20,200,'布洛芬',1,'缓解牙疼',24,'详细描述缓解牙疼','三无公司','销售中',200),
('xyp','103.jpg',30,300,'消炎片',1,'消炎',30,'详细描述消炎','三无公司','销售中',300);

# 12、FaYao 在线发药记录表
INSERT INTO FaYao VALUES
(1,1002,'999',10,2,8),
(2,1004,'blf',5,0,8);





SELECT * FROM Menu;
SELECT * FROM Role;
SELECT * FROM Jur;
SELECT * FROM Usee;
SELECT * FROM KeRome;
SELECT * FROM Doctor;
SELECT * FROM GuaHao;
SELECT * FROM ZhuYuan;
SELECT * FROM Pay;
SELECT * FROM PayRed;
SELECT * FROM Yao;
SELECT * FROM FaYao;



